Revit 2027 API
ImageTypeOptions Methods
The ImageTypeOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValid |  If true the ImageTypeOptions can be used to create or reload an ImageType.
SetExternalResourceReference |  Update the external resource reference to an image.
SetPath(String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
SetPath(String, Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace